БухгалтерскиеЗадачиКР/src/InformationRegisters/СчетаУчетаНоменклатуры/СчетаУчетаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаУчетаНоменклатуры</name>
  <resources>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Счета</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаЗабалансовый</name>
    <type>
      <types>ChartOfAccountsRef.Счета</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаФинансовогоУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.ГруппыФининсовогоУчетаНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БухгалтерскиеЗадачиКР/src/CommonModules/СерверныйСВызовом/Module.bsl
Функция ПолучитьСчетУчетаНоменклатуры(Номенклатура, Организация, Забалансовый = Ложь) Экспорт

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.ГруппаФинансовогоУчетаНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ГруппаФинансовогоУчетаНоменклатуры = ВыборкаДетальныеЗаписи.ГруппаФинансовогоУчетаНоменклатуры;
		
	КонецЦикла;
	
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетаУчетаНоменклатуры.СчетУчета,
	|	СчетаУчетаНоменклатуры.СчетУчетаЗабалансовый,
	|	СчетаУчетаНоменклатуры.Организация,
	|	СчетаУчетаНоменклатуры.ГруппаФинансовогоУчетаНоменклатуры
	|ПОМЕСТИТЬ ВТДанные
	|ИЗ
	|	РегистрСведений.СчетаУчетаНоменклатуры КАК СчетаУчетаНоменклатуры
	|ГДЕ
	|	СчетаУчетаНоменклатуры.Организация В (&Организация, &ПустаяОрганизация)
	|	И СчетаУчетаНоменклатуры.ГруппаФинансовогоУчетаНоменклатуры В (&ПустаяГруппаФинансовогоУчетаНоменклатуры, &ГруппаФинансовогоУчетаНоменклатуры)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанные.СчетУчета,
	|	ВТДанные.СчетУчетаЗабалансовый
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|ГДЕ
	|	ВТДанные.ГруппаФинансовогоУчетаНоменклатуры = &ГруппаФинансовогоУчетаНоменклатуры
	|	И ВТДанные.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТДанные.СчетУчета,
	|	ВТДанные.СчетУчетаЗабалансовый
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|ГДЕ
	|	ВТДанные.ГруппаФинансовогоУчетаНоменклатуры = &ГруппаФинансовогоУчетаНоменклатуры
	|	И ВТДанные.Организация = &ПустаяОрганизация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТДанные.СчетУчета,
	|	ВТДанные.СчетУчетаЗабалансовый
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|ГДЕ
	|	ВТДанные.ГруппаФинансовогоУчетаНоменклатуры = &ПустаяГруппаФинансовогоУчетаНоменклатуры
	|	И ВТДанные.Организация = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТДанные.СчетУчета,
	|	ВТДанные.СчетУчетаЗабалансовый
	|ИЗ
	|	ВТДанные КАК ВТДанные
	|ГДЕ
	|	ВТДанные.ГруппаФинансовогоУчетаНоменклатуры = &ПустаяГруппаФинансовогоУчетаНоменклатуры
	|	И ВТДанные.Организация = &ПустаяОрганизация";
	
	Запрос.УстановитьПараметр("ГруппаФинансовогоУчетаНоменклатуры", ГруппаФинансовогоУчетаНоменклатуры);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПустаяГруппаФинансовогоУчетаНоменклатуры", Справочники.ГруппыФининсовогоУчетаНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяОрганизация", Справочники.Организации.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Возврат ?(Забалансовый , ВыборкаДетальныеЗаписи.СчетУчетаЗабалансовый , ВыборкаДетальныеЗаписи.СчетУчета);
		
	КонецЦикла;

	Возврат ПланыСчетов.Счета.ПустаяСсылка();
	
КонецФункции // ПолучитьСчетУчетаНоменклатуры()

Функция ПересчитатьИзВалютыВВалютуНаСервере(ВалютаИЗ,ВалютаВ,СуммаИз,Дата) Экспорт 

	Возврат Серверный.ПересчитатьИзВалютыВВалюту(ВалютаИЗ,ВалютаВ,СуммаИз,Дата);

КонецФункции // ПересчитатьИзВалютыВВалюту()
